FKDD_COPY_DIFF_3_2026-02-14/Documents/ТТ_ПланСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТТ_ПланСервиса</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТТ_ПланСервиса</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>План</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоказательСервиса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТТ_ПоказателиСервиса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бренд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/ТТ_ПланСервиса/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ТТ_ПланСервиса 
	Движения.ТТ_ПланСервиса.Записывать = Истина;
	Для Каждого ТекСтрокаПлан Из План Цикл
		Движение = Движения.ТТ_ПланСервиса.Добавить();
		Движение.Период = Дата;
		Движение.Организация = ТекСтрокаПлан.Организация;
		Движение.Показатель = ТекСтрокаПлан.ПоказательСервиса;
		Движение.Бренд = ТекСтрокаПлан.Бренд;
		Движение.Сумма = ТекСтрокаПлан.Сумма;
	КонецЦикла;


КонецПроцедуры
